{"html":"<p>I have been using a lot of editors and IDE's since I began programming.\nEclipse, Netbeans, Notepade++, Brackets Editor, Sublime Text 2, Sublime Text 3, Webstorm, Atom Editor and probably some more I forgot.</p>\n<p>Currently, I'm using Visual Studio Code. According to google trends, it is also the most searched editor. There are some excellent reasons for that.</p>\n<ul>\n<li><p>vs code feels fast. It is tough to get vs code to slow down. Usually, it is not the fault of vs code but a poorly implemented extension.</p></li>\n<li><p>File search is super fast. It feels instant. Like there is no wait time.</p></li>\n<li><p>It is lightweight but also has most of the things you need pre-installed. Search files, debugging, basic git GUI.</p></li>\n<li><p>Nice theme support and customization support. You can pretty much change everything in vs code.</p></li>\n<li><p>Excellent extensions! Think of an extension you need? Yeah vs code has that!</p></li>\n</ul>\n<p>Okay, enough of praising. An editor is as good as the user that knows that editor! I assume you have installed vs code.</p>\n<h3 id=\"themefileiconsandfontfamily\">Theme, File icons, and Font-family</h3>\n<p>You will look at vs code for several hours every day.</p>\n<h4 id=\"theme\">Theme</h4>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=RobbOwen.synthwave-vscode\">SynthWave '84</a>  </li>\n</ul>\n<p>I don't have the <code>glow</code> enabled and I did not add the custom CSS.</p>\n<h4 id=\"fileicons\">File icons</h4>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=LaurentTreguier.vscode-simple-icons\">Simple icons</a>  </li>\n</ul>\n<p>Simple icons is a minimalistic clean icon theme that has strong colors and clear icons so you can find the file you need even faster.</p>\n<h4 id=\"font\">Font</h4>\n<ul>\n<li><a href=\"https://github.com/i-tu/Hasklig\">Hasklig</a></li>\n</ul>\n<p>It looks clean to me and has ligatures support.\nMy config (we will learn later how to set this config):</p>\n<pre><code>    \"editor.fontFamily\": \"Hasklig, Consolas, 'Courier New', monospace\",\n    \"editor.fontLigatures\": true,\n    \"editor.fontSize\": 15,\n</code></pre>\n<h3 id=\"extensions\">Extensions</h3>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=CoenraadS.bracket-pair-colorizer-2\">Bracket Pair Colorizer 2</a></li>\n</ul>\n<p>This should be built-in into every editor! Have you ever had code where you didn't know where your <code>{</code> started and it then <code>}</code> ended?\nThen this extension is what you need! It will give every <code>{</code> or <code>(</code> a different color, so it is easier to look at the code.</p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=oderwat.indent-rainbow\">indent-rainbow</a></li>\n</ul>\n<p>This adds diffrent colors to every indent tab or space you do.\nThis also helps you to navigate your code faster.</p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=mikestead.dotenv\">DotENV</a></li>\n</ul>\n<p><code>.env</code> Files are common these days and are used in a lot of projects. vs code out of the box does not have syntax highlighting support for these file type. This extension adds support for that.</p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=wix.vscode-import-cost\">Import Cost</a></li>\n</ul>\n<p>Also, a must-have for every developer that has performance and speed in mind. It shows you how much in <code>kb</code> it would cost you to import this npm module or anything you can import.</p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.vscode-remote-extensionpack\">Remote Development</a></li>\n</ul>\n<p>This, for me, is a killer feature! Do you connect to your development environment over SSH? Do you use a docker container? Or do you use WSL? This extension makes it extremely easy to use all of them. The best part, even over SSH the search and opening of a file are not slower! This is like magic! I love this extension! </p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=VisualStudioExptTeam.vscodeintellicode\">Visual Studio IntelliCode</a></li>\n</ul>\n<p>This replaces Intellisense. It is like Intellisense with AI-backed in. The tab-completion shows you the most used functions or parameters that other people use, so you have the most used on the right on top. This makes you more efficient!</p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=dbaeumer.vscode-eslint\">ESLint</a></li>\n</ul>\n<p>This adds direct eslint support into vs code, and it helps you to fix your eslint problems. Also a must-have.</p>\n<h3 id=\"settings\">Settings</h3>\n<p>I'm not using the UI version of the settings interface. I rather like to use the JSON version. To open that press <code>CTRL+SHIFT+P</code> and then type <code>open settings JSON</code>. This will open the <code>settings.json</code> file, and you can edit it like any other JSON file.</p>\n<h4 id=\"makingthecursorstylish\">Making the cursor stylish</h4>\n<pre><code class=\"JSON language-JSON\">    \"editor.cursorBlinking\": \"smooth\",\n    \"editor.cursorSmoothCaretAnimation\": true,\n    \"editor.cursorStyle\": \"block\",\n</code></pre>\n<p>The first line will make the cursor blink a little bit mor smooth with a fade-in-out animation.\nThe second line will animate the movement of the course, so it feels a little bit more natural.\nThe thrid line will change the appearance of the cursor to a block so you can find it more comfortable.\nNow your cursor looks way better!</p>\n<h4 id=\"makingthefontmorereadable\">Making the font more readable</h4>\n<pre><code>    \"editor.fontFamily\": \"Hasklig, Consolas, 'Courier New', monospace\",\n    \"editor.fontLigatures\": true,\n    \"editor.fontSize\": 15,\n</code></pre>\n<p>As described before I'm using the Hasklig font. Also, I like to have Ligatures; it makes the code more readable. I don't have perfect eyesight. So I like the font to be a little bit bigger. </p>\n<h4 id=\"copyandpastecode\">Copy and Paste code</h4>\n<pre><code>    \"editor.formatOnPaste\": true,\n</code></pre>\n<p>We all copy and paste some code from the internet. So this setting will also format it on paste.</p>\n<h4 id=\"maketheverticalguidelinesvisible\">Make the vertical guidelines visible</h4>\n<pre><code>    \"editor.renderIndentGuides\": true,\n</code></pre>\n<p>If you have a long function with a lot of indentation, this will help you to navigate your code easier.</p>\n<h4 id=\"disabletelemetery\">Disable telemetery</h4>\n<pre><code>    \"telemetry.enableTelemetry\": false,\n</code></pre>\n<p>Even when I use vscode-insiders, I don't need to send my data to Microsoft. So I disable that</p>\n<h4 id=\"seetabsthathavebeenmodified\">See tabs that have been modified</h4>\n<pre><code>    \"workbench.editor.highlightModifiedTabs\": true,\n</code></pre>\n<p>Unsaved files have that big dot where the <code>x</code> if you did not save. This will also add a line on the top of the tab.</p>\n<h3 id=\"tippsandtricks\">Tipps and Tricks</h3>\n<h4 id=\"usingwsl\">Using WSL</h4>\n<p>WSL or windows subsystem for Linux is a fantastic way to run Linux on Windows and have access to the Linux development experience that for me is way better than the one on windows.\nI don't want to install git under windows and also not things like nodejs. There is a pretty nice way to integrate the git version of your wsl Linux into vs code. You need to download <a href=\"https://github.com/andy-5/wslgit\">WSLGIT</a> and then put the exe file in a nice place and add the following line to your vs code settings:</p>\n<pre><code>    \"git.path\": \"D:\\\\dev\\\\wslgit.exe\",\n</code></pre>\n<p>Also vs code has an integrated terminal. You can open that terminal with <code>ctrl+\\`</code>. We also want to have a bash in vs code so we can add the following line:</p>\n<pre><code>    \"terminal.integrated.shell.windows\": \"C:\\\\WINDOWS\\\\System32\\\\wsl.exe\",\n</code></pre>\n<p>This tells vs code to use the default wsl linux shell. In my case, it is Ubuntu, which comes with bash.</p>\n<h4 id=\"usethecommandpallet\">Use the command pallet</h4>\n<p>I often see people clicking around to find settings or other features in vs code. Usually, it is easier just to type what you want. For this vs code has the command pallet. Just press <code>CTRL+SHIFT+P</code>. This will open the command pallet, and you can just type what you want!\nIf you don't want to press <code>SHIFT</code>, then you can just press <code>CTRL+P</code> and type a <code>&gt;</code>, if this is faster for you. <code>CTRL+P</code> is also useful to find a file you need.</p>\n<h4 id=\"reopenyourlatestclosedfile\">Reopen your latest closed file</h4>\n<p>Just press <code>CTL+SHIFT+T</code>. This will reopen the latest closed window. You can press this is multiple times to open multiple windows. This also works in your browser if you closed a tab that you don't want to ;)</p>\n<h4 id=\"deleteacompleteword\">Delete a complete word</h4>\n<p>This is not vs code specific, but sometimes I can hear people pressing the backspace key as fast as they can to delete a word. Please just press <code>CTRL+BACKSPACE</code>. This will delete the whole word.</p>\n<h4 id=\"deleteacompleteline\">Delete a complete line</h4>\n<p>Sometimes you want to delete the complete line. Just press <code>CTRL+X</code>. This will delete the currently selected line completely. </p>\n<h4 id=\"theend\">The end</h4>\n<p>Do you use vs code? What is your must-have extension?\nDid I miss some crucial settings? Is some shortcut missing? Please comment down below!</p>\n<p><strong>Thanks for reading!</strong></p>\n<p><strong>Say Hallo!</strong> <a href=\"https://www.instagram.com/lampewebdev/\">Instagram</a> | <a href=\"https://twitter.com/lampewebdev\">Twitter</a> | <a href=\"https://www.linkedin.com/in/michael-lazarski-25725a87\">LinkedIn</a> | <a href=\"https://medium.com/@lampewebdevelopment\">Medium</a> | <a href=\"https://dev.to/twitch_live_streams/lampewebdev\">Twitch</a> | <a href=\"https://www.youtube.com/channel/UCYCe4Cnracnq91J0CgoyKAQ\">YouTube</a></p>","title":"💻My Web Development VS Code Settings, theme, Extensions, tips and tricks","createdAt":"21.07.2019","description":"Learn what settings, theme, font, extensions and other things I use in vscode"}