{"html":"<p><img src=\"https://thepracticaldev.s3.amazonaws.com/i/0i8woivrnho11aae5brp.png\" alt=\"Cover Image\" /></p>\n<h1 id=\"introduction\">Introduction</h1>\n<p>Visual Studio Code lets you access almost every feature it provides by a command that is accessible via the command palette or via a shortcut on your keyboard.</p>\n<p>You are probably working 8 hours every workday and hopefully for you the most time of these working hours you can code. So you are spending much time staring at your code editor of choice.</p>\n<p>Knowing some shortcuts can help you to get your work done faster. Knowing how to find the file you need faster. Running your NPM command, you need right now, instead of opening an external Terminal.</p>\n<p><img src=\"https://media.giphy.com/media/eMxZ6lPl8dW9O/giphy.gif\" alt=\"hands typing quickly on a keyboard\" /></p>\n<h1 id=\"shortcutcheatsheets\">Shortcut cheat sheets</h1>\n<p>The makers of Visual Studio Code</p>\n<ul>\n<li><a href=\"https://code.visualstudio.com/shortcuts/keyboard-shortcuts-windows.pdf\">Windows</a></li>\n<li><a href=\"https://code.visualstudio.com/shortcuts/keyboard-shortcuts-linux.pdf\">Linux</a></li>\n<li><a href=\"https://code.visualstudio.com/shortcuts/keyboard-shortcuts-macos.pdf\">MacOS</a></li>\n</ul>\n<p>You can download these cheat sheets, print them, and put them on your desk for a quick reference or try to learn them while your commuting to work. Don't try to learn them all at once. This takes time. So be patient, and you master them all.</p>\n<h1 id=\"keymaps\">Keymaps</h1>\n<p>Are you a Vim user? Maybe the Emacs shortcuts are tattoed into your brain? Alternatively, for whatever reason, you used notepad++ and appreciated the keyboard shortcuts from notepad++😵?</p>\n<p>Visual Studio has an extension for all of you! Let's install the ⚛<code>Atom Keymap</code>. We will do this without the help of our beloved mouse (almost). </p>\n<p>1) Open Visual Studio Code.</p>\n<p>2) Once Visual Studio Code is open press: <code>CTRL+SHIFT+X</code>. That shortcut opens the Extension list, and your cursor focuses the search bar. Type the following <code>@category:keymaps</code>. (If you want to know more about how extensions work in how this section works leave a comment down below!)</p>\n<p>3) You see now a list of keymaps. Press <code>Tab</code> and then the <code>Down Arrow ⬇</code>.</p>\n<p>4) Press <code>⬇</code> until you have selected the <code>Atom  Keymap</code>. Now press <code>Enter</code>. </p>\n<p>5) Sadly I can not find a method for selecting the Install button. You now need to click🖱! </p>\n<p>You can find a Keymap for almost every editor you can imagine. Install the one you like the most, and you have your shortcuts! Cool right?</p>\n<h1 id=\"keyboardshortcutssettingsjson\">Keyboard Shortcuts settings (JSON)</h1>\n<p>There are to ways to view the Keyboard Shortcut Settings. One of them is through a graphical interface or can also choose to use to edit the shortcuts through a JSON file.</p>\n<h2 id=\"graphicalinterface\">Graphical interface</h2>\n<p>We can open the Graphical interface by pressing <code>CTRL+k</code> and then by still holding <code>CTRL</code> you should press <code>CTRL+s</code>.</p>\n<p><img src=\"https://thepracticaldev.s3.amazonaws.com/i/3etyosi4ljtp1d9lvk5i.png\" alt=\"Keyboard Shortcut Settings GUI\" /></p>\n<p>On the top, you have a search bar where you can search for either the command or the keyboard shortcut you want to check out. These dialouges tend to look the same in Visual Studio Code and you will start to see them alot.</p>\n<p>You can see four columns. Let's go through them.</p>\n<p>*Command: The action Visual Studio Code performs.</p>\n<ul>\n<li><p>Keybinding: The combination of keys you have to press the execute the action.</p></li>\n<li><p>When: This is a filter for Visual Studio Code It tells Visual Studio Code if the shortcut should be actionable in that context or not. Some filters could be the integrated terminal, an error in your source code, and many more.</p></li>\n<li><p>Source: There are multiple ways of how Visual Studio code can know about shortcuts. The most common one is <code>Default</code> these are the commands that come with Visual Studio Code out of the box. <code>User</code> is as the name suggest commands that are created by the user. The third way is by <code>Extension</code>. An extension author can also decide to add a shortcut. If your favourite shortcut does not work, this can be a source of why it stopped working.</p></li>\n</ul>\n<p>To change the keybinding, you double click the row and a modal pops up. Then you press the key combination you want and hit <code>Enter</code>. </p>\n<h2 id=\"keybindingsjsonfile\">key bindings JSON file</h2>\n<p>Now that we know how it key bindings work in general let's have a look at at the <code>keybindings.json</code> file. </p>\n<p>There are two of these the default <code>keybindings.json</code> and the user-specific <code>keybindings.json</code> file. Press <code>CTRL+SHIFT+P</code> or <code>F1</code> to open the command pallet and type <code>keyboard shortcuts</code> you now should see at least two entries in your command pallet. </p>\n<ul>\n<li><p>Preferences: Open Default Keyboard Shortcuts (JSON).\nThis is the file where Visual Studio Code Stores all the default Shortcuts and a list of available shortcuts at the bottom that are not used. I would avoid changing them here.</p></li>\n<li><p>Preferences: Open Keyboard Shortcuts (JSON)\nThis is a user-specific key bindings file, and you should edit this file. In the beginning, it will be just an empty array nothing more!</p></li>\n</ul>\n<p>To add a shortcut in the JSON file you simply just need to add an object like the following one:</p>\n<pre><code class=\"js language-js\">[\n    {\n        \"key\": \"CTRL+ALT+P\",\n        \"command\": \"git.pull\",\n        \"when\": \"\"\n    }\n]\n</code></pre>\n<p>You need to specify the key and the command. The <code>when</code> tells Visual Studio Code where it should run this command. If you leave it empty, it will listen everywhere for it. We talked about this in the last part.</p>\n<h1 id=\"usefulshortcuts\">Useful shortcuts</h1>\n<h2 id=\"openthecommandpalette\">Open the Command Palette</h2>\n<p>You know this one already, but maybe you skipped to this part 😉</p>\n<ul>\n<li><code>CRTL+SHIFT+P</code> or <code>F1</code>\nThis will open the most powerful feature in Visual Studio Code. The Command Palette. Just type what you think you want and it still finds it!</li>\n</ul>\n<h2 id=\"openingandclosingthesidebar\">Opening and closing the sidebar</h2>\n<p>Sometimes you want to have more horizontal space, and the sidebar is in your way! Just press</p>\n<ul>\n<li><code>CTRL+B</code></li>\n</ul>\n<p>You can toggle the sidebar on and off</p>\n<h2 id=\"enterzenmod\">Enter Zen Mod</h2>\n<p>You are like what Zen Mod in Visual Studio code? Yes, its build-in!\nFor that, you need to press:</p>\n<ul>\n<li><code>CTRL+k</code>, let go of both keys and press <code>z</code>.</li>\n</ul>\n<p>This will toggle Zen Mod on and off.</p>\n<h2 id=\"focustheintegratedterminal\">Focus the integrated Terminal</h2>\n<p>One of my favourite features is the integrated terminal in Visual Studio Code. I'm using it 99% of the time! So to quickly open or close it, you need to press:</p>\n<ul>\n<li><code>CTRL+j</code></li>\n</ul>\n<p>This will open the integrated terminal and focus the cursor in it. If you press it again, it will close, and your cursor goes back to where it was. </p>\n<h2 id=\"searchforafileinyourproject\">Search for a file in your project</h2>\n<p>Visual Studio Code has a great file search build-in. It is also super fast when you use the remote Extension. To open it you simply press:</p>\n<ul>\n<li><code>CTRL+p</code></li>\n</ul>\n<p>This opens a dialogue where you can see your recent open files that alone is very nice. It also supports fuzzy search. This means you can type any word, and it looks in the hole path of the file. So you don't have to be exact! That dialogue also supports a lot more things. Like <code>go-to line</code> or debugging and a lot more features! If you would like to know more comment down below.</p>\n<h2 id=\"switchtoarecentopenworkspace\">Switch to a recent open workspace</h2>\n<p>You work in a microservice architecture and need to switch folders all the time? Because you don't use a mono repo? I have the shortcut for you! Press:</p>\n<ul>\n<li><code>CTRL+r</code></li>\n</ul>\n<p>This opens a dialogue with a list of recent open workspaces/folders.\nBonus tip: If you hit <code>CTRL+ENTER</code> in that dialogue Visual Studio Code opens it in a new window.</p>\n<h2 id=\"splityoureditorwindow\">Split your editor window</h2>\n<p>People love vim because it is easy to split views among the editor. Visual Studio Code has that also build in. Just press</p>\n<ul>\n<li><code>CTRL+\\</code></li>\n</ul>\n<p>To create 2 columns or</p>\n<ul>\n<li><code>CTRL+k</code>, let go of <code>k</code> and hold <code>CTRL</code> and press <code>\\</code></li>\n</ul>\n<p>To create a new row. The second one sounds harder then it is, but once it is in your brain it takes you ms, and you know how to change or create new shortcuts now 😉</p>\n<h2 id=\"focusaneditorwindow\">Focus an editor window</h2>\n<p>Now that you know how to split the editor window, you also need to learn how to jump around these views quickly. This is pretty easy and also has a default key binding. You need to press</p>\n<ul>\n<li><code>CTRL+[1-9]</code></li>\n</ul>\n<p>This means that you need to press <code>CTRL</code> plus the number of the window you want to focus on. For the first one press <code>CTRL+1</code> and the second window <code>CTRL+2</code>, you get the idea  Easy right?</p>\n<h2 id=\"closeyourcurrenteditorwindow\">Close your current editor window</h2>\n<p>Now you opened too many editor windows, and you want to close them. This is quickly done by pressing</p>\n<ul>\n<li><code>CTRL+w</code></li>\n</ul>\n<p>This closes the currently opened window.</p>\n<h2 id=\"closeonlythesavededitorwindows\">Close only the saved editor windows</h2>\n<p>Sometimes you have so many editors open that you don't know anymore what is saved whatnot. Yeah, I know you can see this with that dot in the tab bar, but still, it is too much for you to focus and find the right files. Visual Studio Code has your back! Just press</p>\n<ul>\n<li><code>CTRL+k</code> then let go of <code>CTRL</code> and <code>k</code> and press <code>u</code></li>\n</ul>\n<p>This saves all windows so you can check the unsaved windows and save them.</p>\n<h2 id=\"openanewfile\">Open a new file</h2>\n<p>You need a new file to sketch some code? Alternatively, you need to create a new file for your pet project? Press</p>\n<ul>\n<li><code>CTRL+n</code></li>\n</ul>\n<p>This opens a new editor.</p>\n<h2 id=\"changethelanguageofyourcurrentfile\">Change the language of your current file</h2>\n<p>You want to switch the selected language in your current file because you want <code>Javascript (react)</code> and not <code>Javascript</code>? Press</p>\n<ul>\n<li><code>CTRL+k</code>\nThen let go of <code>CTRL</code> and <code>k</code> and press 'm`.</li>\n</ul>\n<p>This opens a new dialogue where you can search for the language you desire.</p>\n<h2 id=\"gotoline\">Go to Line</h2>\n<p>Let's now focus a little bit how to make editing easier. You have an error in line 1042(If your file is that long that alone is the problem). You don't want to scroll! Press</p>\n<ul>\n<li><code>CTRL+g</code></li>\n</ul>\n<p>This opens a dialogue, and you need to input the line number you want to jump to. This, combined with <code>CTRL+p</code> can be very powerful.</p>\n<h2 id=\"gotosymbol\">Go to Symbol</h2>\n<p>Your first question is, what is a Symbol? In programming languages, symbols are usually variables. In CSS, they are selectors. To see the dialogue press</p>\n<ul>\n<li><code>CTRL+SHIFT+O</code></li>\n</ul>\n<p>This opens a dialogue with a list of available symbols in the current file.</p>\n<ul>\n<li><code>CTRL+t</code></li>\n</ul>\n<p>You see a dialogue with just a <code>#</code> in it, and you need to type the symbol you want, and Visual Studio Code searches in the hole workspace for that symbol if this is supported by the language you are using. So you need to check that on your own.</p>\n<h2 id=\"movingalineupordown\">Moving a line up or down.</h2>\n<p>Sometimes you need to move out that line that you had inside your <code>if</code> or just move a line because it's called to early. You can do that by pressing</p>\n<ul>\n<li><code>Alt+Down</code></li>\n</ul>\n<p>To move the current selected line one line down</p>\n<ul>\n<li><code>Alt+Up</code></li>\n</ul>\n<p>To move the currently selected line one line up</p>\n<h2 id=\"copythecurrentline\">Copy the current line</h2>\n<p>You want to fill that array with some variables, but you are too lazy to write a loop. So how do you get <code>array[0]</code> <code>array[1]</code> and <code>array[2]</code> populated? By copying the first line twice and just changing what you need. For that press</p>\n<ul>\n<li><code>ALT+SHIFT+Up</code></li>\n</ul>\n<p>This copies the currently selected line and pastes it in one line above</p>\n<ul>\n<li><code>ALT+SHIFT+Down</code></li>\n</ul>\n<p>This copies the currently selected line and pastes it in one line beneath\n(This shortcut would have been handy here)</p>\n<h2 id=\"showasuggestion\">Show a suggestion</h2>\n<p>Visual Studio Code has build-in suggestions. Most of the time it pop-ups automatically for you but sometimes it won't, and you really need it. Easy, press</p>\n<ul>\n<li><code>CTRL+Spacebar</code></li>\n</ul>\n<p>This opens the suggestion dialogue</p>\n<h2 id=\"commentoutthecurrentselection\">Comment out the current selection</h2>\n<p>Sometimes you need to isolate code and comment out everything around it. Press</p>\n<ul>\n<li><code>CTRL+/</code></li>\n</ul>\n<p>If you multiple lines selected it comments them out. If you don't have anything selected, it comments out that one line only.</p>\n<h2 id=\"selectmultiplelinesofcode\">Select multiple lines of code</h2>\n<p>To comment out that code block, you need to select more than one line. This is done by pressing</p>\n<ul>\n<li><code>CTRL+Shift+Up</code></li>\n</ul>\n<p>To start selecting from the current line and moving the cursor up.</p>\n<ul>\n<li><code>CTRL+Shift+down</code></li>\n</ul>\n<p>To start selecting from the current line and moving the cursor down.</p>\n<h2 id=\"foldandunfoldyourcode\">Fold and unfold your code</h2>\n<p>You have this big function, but you really can not see it anymore because it is too big and need refactoring, but you don't have the time, so you want to forget about it? You can fold and unfold code so that out of 100 lines you can make 1 line. To do that press</p>\n<ul>\n<li><code>CTRL+SHIFT+[</code></li>\n</ul>\n<p>To fold(hide) the code</p>\n<ul>\n<li><code>CTRL+SHIFT+]</code></li>\n</ul>\n<p>To unfold(show) the code</p>\n<h2 id=\"cutaholeline\">Cut a hole line</h2>\n<p>For this one, you can not have any code selected. Press</p>\n<ul>\n<li><code>CTRL+x</code></li>\n</ul>\n<p>This cuts the entire line when nothing is selected.</p>\n<h2 id=\"indentoutdentline\">Indent / Outdent Line</h2>\n<p>People usually know how to Indent code. You do it by selecting the code you want to indent and press</p>\n<ul>\n<li><code>Tab</code></li>\n</ul>\n<p>Press Tab as many times as you wish so that it looks good to you.\nDid you know that you can Outdent? Moving your code from right to left? You do that by pressing</p>\n<ul>\n<li><code>SHIFT+tab</code></li>\n</ul>\n<h1 id=\"conclusion\">Conclusion</h1>\n<p>There are way more shortcuts. These shortcuts are the one I use the most often. I hope this helps you to understand more how shortcuts in Visual Studio Code and that you can now create your own one.</p>\n<p>Have I overlooked a useful command that everybody needs to know?\nDid you miss something? Was something not clear?\nPlease write a comment. I answer all of your questions as best as I can!</p>\n<p><strong>👋Say Hallo!</strong> <a href=\"https://www.instagram.com/lampewebdev/\">Instagram</a> | <a href=\"https://twitter.com/lampewebdev\">Twitter</a> | <a href=\"https://www.linkedin.com/in/michael-lazarski-25725a87\">LinkedIn</a> | <a href=\"https://medium.com/@lampewebdevelopment\">Medium</a> | <a href=\"https://dev.to/twitch_live_streams/lampewebdev\">Twitch</a> | <a href=\"https://www.youtube.com/channel/UCYCe4Cnracnq91J0CgoyKAQ\">YouTube</a></p>","title":"💻The guide to Visual Studio Code shortcuts, higher productivity and 30 of my favourite shortcuts you need to learn","createdAt":"04.08.2019","description":"Learn how to use Visual Studio Code keyboard shortcuts for higher productivity"}